In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv(r'./datasets/athlete_events.csv')

In [86]:
noc= pd.read_csv(r'./datasets/noc_regions.csv')

In [3]:
df.head(3)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN

In [4]:
df.rename(columns={'h':'height','weight_kg':'weight'},inplace=True)

catogory the data

In [5]:
def cato(c):
    if c['Height']<165 and c['Weight']<60:
        return "light weight"
    elif c['Height']<185 or c['Weight']<=80:
        return "middleweight"
    else:
        return "heavyweight"
    


df['category'] =df.apply(cato,axis=1)

In [6]:
df.iloc[:,15]

0         middleweight
1         middleweight
2          heavyweight
3          heavyweight
4          heavyweight
              ...
271111    middleweight
271112    middleweight
271113    middleweight
271114     heavyweight
271115     heavyweight
Name: category, Length: 271116, dtype: object

In [7]:
df.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal', 'category'],
      dtype='object')

india athelte win gold meadal filter

In [8]:
df[(df['NOC'] == 'IND') & (df['Medal'] == 'Gold')].value_counts(ascending=0).count()

np.int64(40)

which athlete win gold medal more in world

In [9]:
gold =df[df['Medal']=='Gold']

In [10]:
gold['Name'].value_counts().head(5)

Name
Michael Fred Phelps, II               23
Raymond Clarence "Ray" Ewry           10
Larysa Semenivna Latynina (Diriy-)     9
Mark Andrew Spitz                      9
Paavo Johannes Nurmi                   9
Name: count, dtype: int64

Find the top 5 athletes with the most total medals

Find the number of medals won in each Sport.

In [11]:
df.groupby('Sport')['Medal'].count().reset_index().value_counts(ascending=0)

Sport             Medal
Aeronautics       1        1
Alpine Skiing     428      1
Alpinism          25       1
Archery           353      1
Art Competitions  156      1
                          ..
Tug-Of-War        115      1
Volleyball        969      1
Water Polo        1057     1
Weightlifting     646      1
Wrestling         1296     1
Name: count, Length: 66, dtype: int64

Find which Sport has the highest number of participating athletes.

In [12]:
df.groupby('Sport')['Name'].nunique().reset_index().value_counts(ascending=0)

Sport             Name
Aeronautics       1       1
Alpine Skiing     2734    1
Alpinism          25      1
Archery           1113    1
Art Competitions  1814    1
                         ..
Tug-Of-War        160     1
Volleyball        2502    1
Water Polo        2599    1
Weightlifting     2880    1
Wrestling         4987    1
Name: count, Length: 66, dtype: int64

Find the country that won the most medals in Football.

In [64]:
df.tail(2)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,category
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,2012,Winter,Nagano,Football,Bobsleigh Men's Four,NaN,heavyweight
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2012,Winter,Salt Lake City,Football,Bobsleigh Men's Four,NaN,heavyweight

Find which country won the most Gold medals in 2012 London Olympics.

In [ ]:
# df.drop(columns={'year','football1'},inplace=True)

IN 2012 COUNT COUNTRY WISE MEDAL

In [52]:
gold2012 =df[(df['year']==2012) & (df['Medal']=='Gold')]

In [67]:
gold2012.tail(1)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,category,football1,year
271076,135553,Galina Ivanovna Zybina (-Fyodorova),F,21.0,168.0,80.0,Soviet Union,URS,1952 Summer,2012,Summer,Helsinki,Football,Athletics Women's Shot Put,Gold,middleweight,Football,2012

In [66]:
gold2012.groupby('year')['NOC'].value_counts(ascending=0).reset_index()

     year  NOC  count
0    2012  USA   2638
1    2012  URS   1082
2    2012  GER    745
3    2012  GBR    678
4    2012  ITA    575
..    ...  ...    ...
104  2012  SUR      1
105  2012  SYR      1
106  2012  TJK      1
107  2012  UAE      1
108  2012  VIE      1

[109 rows x 3 columns]

In [79]:
foot = df[(df['Sport']=='Football') & (df['Sport'].notna())]

In [80]:
foot.shape

(271116, 16)

In [75]:
foot.tail()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,category
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,2012,Winter,Innsbruck,Football,Luge Mixed (Men)'s Doubles,NaN,middleweight
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2012,Winter,Sochi,Football,"Ski Jumping Men's Large Hill, Individual",NaN,middleweight
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2012,Winter,Sochi,Football,"Ski Jumping Men's Large Hill, Team",NaN,middleweight
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,2012,Winter,Nagano,Football,Bobsleigh Men's Four,NaN,heavyweight
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2012,Winter,Salt Lake City,Football,Bobsleigh Men's Four,NaN,heavyweight

In [77]:
foot['NOC'].value_counts(ascending=0).reset_index()

     NOC  count
0    USA  18853
1    FRA  12758
2    GBR  12256
3    ITA  10715
4    GER   9830
..   ...    ...
225  YMD      5
226  SSD      3
227  NBO      2
228  UNK      2
229  NFL      1

[230 rows x 2 columns]

In [78]:
foot.shape

(271116, 16)

MERGING AND CONCATENATION

In [88]:
noc.head(3)

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN